---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.IsValidObject
source: html/b97afd97-bb08-a803-044c-6a7d5fd7741c.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.